; domain
(define (domain p2)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    carrier_space
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (empty-space ?carrier - carrier ?space - carrier_space)
    (next ?numA - num ?numB - num) 
    (crate-at-space ?crate - crate ?carrier - carrier ?space - carrier_space) 
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (empty-space ?carrier ?carrier_space)           
    )
    :effect (and
        (not (empty-space ?carrier ?carrier_space))
        (crate-at-space ?crate ?carrier ?carrier_space)        
        (not (crate-at ?crate ?location))    
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)     
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
        ?person - person
        ?content - content 
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (crate-at-space ?crate ?carrier ?carrier_space)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
    )
    :effect (and
        (empty-space ?carrier ?carrier_space)
        (not (crate-at-space ?crate ?carrier ?carrier_space))        
        (has-content-person ?person ?content)   
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l14_p14_c14_g14_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	carrier1 - carrier
	space1 - carrier_space
	space2 - carrier_space
	space3 - carrier_space
	space4 - carrier_space
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
	N5 - num
	N6 - num
	N7 - num
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(carrier-at carrier1 depot)
	(empty-space carrier1 space1)
	(empty-space carrier1 space2)
	(empty-space carrier1 space3)
	(empty-space carrier1 space4)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate medicine crate4)
	(content-crate medicine crate5)
	(content-crate medicine crate6)
	(content-crate medicine crate7)
	(content-crate medicine crate8)
	(content-crate medicine crate9)
	(content-crate medicine crate10)
	(content-crate medicine crate11)
	(content-crate medicine crate12)
	(content-crate medicine crate13)
	(content-crate medicine crate14)
	(person-at person1 loc6)
	(person-at person2 loc13)
	(person-at person3 loc8)
	(person-at person4 loc10)
	(person-at person5 loc2)
	(person-at person6 loc5)
	(person-at person7 loc1)
	(person-at person8 loc8)
	(person-at person9 loc5)
	(person-at person10 loc3)
	(person-at person11 loc5)
	(person-at person12 loc14)
	(person-at person13 loc11)
	(person-at person14 loc2)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 medicine)
	(has-content-person person2 medicine)
	(has-content-person person3 medicine)
	(has-content-person person4 medicine)
	(has-content-person person5 medicine)
	(has-content-person person6 medicine)
	(has-content-person person8 medicine)
	(has-content-person person9 food)
	(has-content-person person10 medicine)
	(has-content-person person11 food)
	(has-content-person person11 medicine)
	(has-content-person person12 medicine)
	(has-content-person person13 food)
	(has-content-person person13 medicine)
))
)

; plan
1. (put-crate-in-carrier crate14 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate14 depot)
   added: (crate-at-space crate14 carrier1 space4)
   goals met: 1 of 15
2. (put-crate-in-carrier crate3 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate3 depot)
   added: (crate-at-space crate3 carrier1 space3)
   goals met: 1 of 15
3. (move-carrier depot loc14 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc14) (carrier-at carrier1 loc14)
   goals met: 0 of 15
4. (pick-and-drop crate14 loc14 drone1 carrier1 space4 person12 medicine)
   deleted: (crate-at-space crate14 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person12 medicine)
   goals met: 1 of 15
5. (move-carrier loc14 depot drone1 carrier1)
   deleted: (drone-at drone1 loc14) (carrier-at carrier1 loc14)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 2 of 15
6. (put-crate-in-carrier crate13 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate13 depot)
   added: (crate-at-space crate13 carrier1 space4)
   goals met: 2 of 15
7. (move-carrier depot loc13 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc13) (carrier-at carrier1 loc13)
   goals met: 1 of 15
8. (pick-and-drop crate13 loc13 drone1 carrier1 space4 person2 medicine)
   deleted: (crate-at-space crate13 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person2 medicine)
   goals met: 2 of 15
9. (move-carrier loc13 depot drone1 carrier1)
   deleted: (drone-at drone1 loc13) (carrier-at carrier1 loc13)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 15
10. (put-crate-in-carrier crate12 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate12 depot)
   added: (crate-at-space crate12 carrier1 space4)
   goals met: 3 of 15
11. (move-carrier depot loc10 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc10) (carrier-at carrier1 loc10)
   goals met: 2 of 15
12. (pick-and-drop crate12 loc10 drone1 carrier1 space4 person4 medicine)
   deleted: (crate-at-space crate12 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person4 medicine)
   goals met: 3 of 15
13. (move-carrier loc10 depot drone1 carrier1)
   deleted: (drone-at drone1 loc10) (carrier-at carrier1 loc10)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 4 of 15
14. (put-crate-in-carrier crate11 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate11 depot)
   added: (crate-at-space crate11 carrier1 space4)
   goals met: 4 of 15
15. (move-carrier depot loc6 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   goals met: 3 of 15
16. (pick-and-drop crate11 loc6 drone1 carrier1 space4 person1 medicine)
   deleted: (crate-at-space crate11 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person1 medicine)
   goals met: 4 of 15
17. (move-carrier loc6 depot drone1 carrier1)
   deleted: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 5 of 15
18. (put-crate-in-carrier crate10 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate10 depot)
   added: (crate-at-space crate10 carrier1 space4)
   goals met: 5 of 15
19. (move-carrier depot loc3 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   goals met: 4 of 15
20. (pick-and-drop crate10 loc3 drone1 carrier1 space4 person10 medicine)
   deleted: (crate-at-space crate10 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person10 medicine)
   goals met: 5 of 15
21. (move-carrier loc3 depot drone1 carrier1)
   deleted: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 6 of 15
22. (put-crate-in-carrier crate9 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate9 depot)
   added: (crate-at-space crate9 carrier1 space4)
   goals met: 6 of 15
23. (move-carrier depot loc2 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   goals met: 5 of 15
24. (pick-and-drop crate9 loc2 drone1 carrier1 space4 person5 medicine)
   deleted: (crate-at-space crate9 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person5 medicine)
   goals met: 6 of 15
25. (move-carrier loc2 depot drone1 carrier1)
   deleted: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 7 of 15
26. (put-crate-in-carrier crate8 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate8 depot)
   added: (crate-at-space crate8 carrier1 space4)
   goals met: 7 of 15
27. (put-crate-in-carrier crate7 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate7 depot)
   added: (crate-at-space crate7 carrier1 space2)
   goals met: 7 of 15
28. (move-carrier depot loc11 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc11) (carrier-at carrier1 loc11)
   goals met: 6 of 15
29. (pick-and-drop crate7 loc11 drone1 carrier1 space2 person13 medicine)
   deleted: (crate-at-space crate7 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person13 medicine)
   goals met: 7 of 15
30. (pick-and-drop crate3 loc11 drone1 carrier1 space3 person13 food)
   deleted: (crate-at-space crate3 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person13 food)
   goals met: 8 of 15
31. (move-carrier loc11 depot drone1 carrier1)
   deleted: (drone-at drone1 loc11) (carrier-at carrier1 loc11)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 9 of 15
32. (put-crate-in-carrier crate2 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate2 depot)
   added: (crate-at-space crate2 carrier1 space3)
   goals met: 9 of 15
33. (put-crate-in-carrier crate6 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate6 depot)
   added: (crate-at-space crate6 carrier1 space2)
   goals met: 9 of 15
34. (move-carrier depot loc8 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   goals met: 8 of 15
35. (pick-and-drop crate6 loc8 drone1 carrier1 space2 person3 medicine)
   deleted: (crate-at-space crate6 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person3 medicine)
   goals met: 9 of 15
36. (pick-and-drop crate8 loc8 drone1 carrier1 space4 person8 medicine)
   deleted: (crate-at-space crate8 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person8 medicine)
   goals met: 10 of 15
37. (move-carrier loc8 depot drone1 carrier1)
   deleted: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 11 of 15
38. (put-crate-in-carrier crate5 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate5 depot)
   added: (crate-at-space crate5 carrier1 space4)
   goals met: 11 of 15
39. (put-crate-in-carrier crate4 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate4 depot)
   added: (crate-at-space crate4 carrier1 space2)
   goals met: 11 of 15
40. (move-carrier depot loc5 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   goals met: 10 of 15
41. (pick-and-drop crate4 loc5 drone1 carrier1 space2 person6 medicine)
   deleted: (crate-at-space crate4 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person6 medicine)
   goals met: 11 of 15
42. (pick-and-drop crate5 loc5 drone1 carrier1 space4 person11 medicine)
   deleted: (crate-at-space crate5 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person11 medicine)
   goals met: 12 of 15
43. (pick-and-drop crate2 loc5 drone1 carrier1 space3 person9 food)
   deleted: (crate-at-space crate2 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person9 food)
   goals met: 13 of 15
44. (move-carrier loc5 depot drone1 carrier1)
   deleted: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 14 of 15
45. (put-crate-in-carrier crate1 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate1 depot)
   added: (crate-at-space crate1 carrier1 space4)
   goals met: 14 of 15
46. (move-carrier depot loc5 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   goals met: 13 of 15
47. (pick-and-drop crate1 loc5 drone1 carrier1 space4 person11 food)
   deleted: (crate-at-space crate1 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person11 food)
   goals met: 14 of 15
48. (move-carrier loc5 depot drone1 carrier1)
   deleted: (drone-at drone1 loc5) (carrier-at carrier1 loc5)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 15 of 15
